In [1]:
%reload_ext sql

#Connect the notebook with the database
%sql postgresql://user:password@localhost:5432/postgres

### You are given the table named user transactions. Write a query to obtain the list of customers whose first transaction was valued at 60$ or more. Write another query to obtain a list with those valued between 15$ and 50$

In [2]:
%%sql

SELECT *
FROM user_transactions
LIMIT 10;

 * postgresql://user:***@localhost:5432/postgres
10 rows affected.

[(1, 101, 1, 49.99, datetime.datetime(2025, 8, 9, 12, 54, 25, 753088)),
 (2, 102, 8, 75.5, datetime.datetime(2025, 8, 10, 12, 54, 25, 753088)),
 (3, 103, 3, 85.75, datetime.datetime(2025, 8, 11, 12, 54, 25, 753088)),
 (4, 104, 1, 99.99, datetime.datetime(2025, 8, 12, 12, 54, 25, 753088)),
 (5, 105, 5, 45.0, datetime.datetime(2025, 8, 13, 12, 54, 25, 753088)),
 (6, 106, 6, 30.25, datetime.datetime(2025, 8, 14, 12, 54, 25, 753088)),
 (7, 107, 1, 12.5, datetime.datetime(2025, 8, 15, 12, 54, 25, 753088)),
 (8, 108, 7, 60.0, datetime.datetime(2025, 8, 16, 12, 54, 25, 753088)),
 (9, 109, 2, 20.0, datetime.datetime(2025, 8, 17, 12, 54, 25, 753088)),
 (10, 110, 8, 75.5, datetime.datetime(2025, 8, 18, 12, 54, 25, 753088))]

In [3]:
%%sql

SELECT ut.user_id, ut.transaction_id, ut.spend, ut.transaction_date
FROM user_transactions ut
JOIN (
    SELECT user_id, MIN(transaction_date) AS first_txn_date
    FROM user_transactions
    GROUP BY user_id
) t ON ut.user_id = t.user_id AND ut.transaction_date = t.first_txn_date
WHERE ut.spend >= 60;

 * postgresql://user:***@localhost:5432/postgres
3 rows affected.

[(8, 2, 75.5, datetime.datetime(2025, 8, 10, 12, 54, 25, 753088)),
 (3, 3, 85.75, datetime.datetime(2025, 8, 11, 12, 54, 25, 753088)),
 (7, 8, 60.0, datetime.datetime(2025, 8, 16, 12, 54, 25, 753088))]

In [4]:
%%sql

SELECT ut.user_id, ut.transaction_id, ut.spend, ut.transaction_date
FROM user_transactions ut
JOIN (
    SELECT user_id, MIN(transaction_date) AS first_txn_date
    FROM user_transactions
    GROUP BY user_id
) t ON ut.user_id = t.user_id AND ut.transaction_date = t.first_txn_date
WHERE ut.spend BETWEEN 15 AND 50;

 * postgresql://user:***@localhost:5432/postgres
5 rows affected.

[(5, 5, 45.0, datetime.datetime(2025, 8, 13, 12, 54, 25, 753088)),
 (4, 11, 40.0, datetime.datetime(2025, 8, 19, 12, 54, 25, 753088)),
 (6, 6, 30.25, datetime.datetime(2025, 8, 14, 12, 54, 25, 753088)),
 (2, 9, 20.0, datetime.datetime(2025, 8, 17, 12, 54, 25, 753088)),
 (1, 1, 49.99, datetime.datetime(2025, 8, 9, 12, 54, 25, 753088))]

### Write a query to obtain the third transaction of every user.

In [5]:
%%sql 

SELECT user_id, transaction_id, spend, transaction_date
FROM (
    SELECT 
        user_id,
        transaction_id,
        spend,
        transaction_date,
        ROW_NUMBER() OVER (
            PARTITION BY user_id
            ORDER BY transaction_date
        ) AS txn_num
    FROM user_transactions
) t
WHERE txn_num = 3;

 * postgresql://user:***@localhost:5432/postgres
8 rows affected.

[(1, 7, 12.5, datetime.datetime(2025, 8, 15, 12, 54, 25, 753088)),
 (2, 30, 15.25, datetime.datetime(2025, 9, 7, 12, 54, 25, 753088)),
 (3, 45, 80.0, datetime.datetime(2025, 9, 22, 12, 54, 25, 753088)),
 (4, 39, 20.5, datetime.datetime(2025, 9, 16, 12, 54, 25, 753088)),
 (5, 26, 65.5, datetime.datetime(2025, 9, 3, 12, 54, 25, 753088)),
 (6, 20, 88.88, datetime.datetime(2025, 8, 28, 12, 54, 25, 753088)),
 (7, 17, 44.44, datetime.datetime(2025, 8, 25, 12, 54, 25, 753088)),
 (8, 14, 80.0, datetime.datetime(2025, 8, 22, 12, 54, 25, 753088))]

### Bucketing users based on their latest transaction date, write a query to obtain the number of users who made a purchase and the total number of products bought for each transaction date.

In [7]:
%%sql

WITH latest_txn AS (
    SELECT
        user_id,
        MAX(transaction_date) AS latest_date
    FROM user_transactions
    GROUP BY user_id
)
SELECT
    t.transaction_date::date AS txn_date,
    COUNT(DISTINCT t.user_id) AS num_users,
    COUNT(t.product_id) AS total_products
FROM user_transactions t
JOIN latest_txn l
  ON t.user_id = l.user_id
 AND t.transaction_date = l.latest_date
GROUP BY t.transaction_date::date
ORDER BY txn_date;

 * postgresql://user:***@localhost:5432/postgres
8 rows affected.

[(datetime.date(2025, 9, 5), 1, 1),
 (datetime.date(2025, 9, 14), 1, 1),
 (datetime.date(2025, 9, 21), 1, 1),
 (datetime.date(2025, 9, 22), 1, 1),
 (datetime.date(2025, 9, 23), 1, 1),
 (datetime.date(2025, 9, 24), 1, 1),
 (datetime.date(2025, 9, 25), 1, 1),
 (datetime.date(2025, 9, 27), 1, 1)]